INSERT INTO users (username, password, first_name, last_name, role, telegram_link, registered_at)
VALUES ('askar', '123', 'Аскар', 'Весельчак', 'ADMIN', 'https://t.me/askar', '2024-01-06 08:00:00'),
       ('maxim', '123', 'Максим', 'Мудрец', 'USER', 'https://t.me/maxim', '2024-02-10 09:00:00'),
       ('daulet', '123', 'Даулет', 'Силач', 'USER', 'https://t.me/daulet', '2024-03-15 10:00:00');

INSERT INTO rooms (name, floor, capacity)
VALUES ('Meeting Room 02', 2, 10),
       ('Meeting Room 03', 2, 20),
       ('Meeting Room 06', 2, 10),
       ('Meeting Room 07', 2, 20);

INSERT INTO bookings (user_id, room_id, title, description, start_time, end_time)
VALUES (1, 1, 'Встреча команды', 'Обсуждение задач на неделю', '2024-06-06 08:00:00', '2024-06-06 09:00:00'),
       (2, 1, 'Презентация проекта', 'Представление проекта клиенту', '2024-06-06 10:00:00', '2024-06-06 11:30:00'),
       (3, 1, 'Рабочая встреча', 'Обсуждение новых идей', '2024-06-06 14:00:00', '2024-06-06 16:00:00'),

       (1, 2, 'Обзор продукта', 'Показ нового продукта', '2024-06-07 09:00:00', '2024-06-07 10:00:00'),
       (2, 2, 'Совещание', 'Совещание по проекту', '2024-06-07 11:00:00', '2024-06-07 12:30:00'),
       (3, 2, 'Клиентская встреча', 'Обсуждение условий контракта', '2024-06-07 15:00:00', '2024-06-07 17:00:00'),

       (1, 3, 'Тренинг', 'Обучение новых сотрудников', '2024-06-08 08:30:00', '2024-06-08 10:00:00'),
       (2, 3, 'Вебинар', 'Вебинар по новым технологиям', '2024-06-08 10:30:00', '2024-06-08 12:00:00'),
       (3, 3, 'Мозговой штурм', 'Генерация идей для нового проекта', '2024-06-08 13:00:00', '2024-06-08 15:00:00'),

       (1, 4, 'Семинар', 'Семинар по улучшению процессов', '2024-06-09 09:00:00', '2024-06-09 11:00:00'),
       (2, 4, 'Стратегическая сессия', 'Планирование стратегии на год', '2024-06-09 12:00:00', '2024-06-09 14:30:00'),
       (3, 4, 'Пресс-конференция', 'Анонс нового продукта', '2024-06-09 15:00:00', '2024-06-09 16:00:00');
